/* -------------------------------------------------------------------------- */
/* ファイル名：jangenGame.c                                                        */
/* 作 成 日：2026/10/28                                                       */
/* 作 成 者：0G04006 ウェイミヨーカイン                                               */
/* -------------------------------------------------------------------------- */
/* ヘッダファイル------------------------------------------------------------ */
#include<stdio.h>
#include<stdlib.h>
#include<time.h>
#include<string.h>

/* プロトタイプ宣言---------------------------------------------------------- */
void startGame();
void result(char *value1, char *value2);

/* マクロ定義---------------------------------------------------------------- */


/* グローバル変数------------------------------------------------------------ */

/* main関数------------------------------------------------------------------ */
int main (void){

    printf("じゃんけんをします\nスペースキーを押してください\n");
    printf("\nじゃんけん・・・\n");
    printf("何を出す？\n");
    printf("グー：1\nパー：2\nチョキ：3\n\n> ");
    startGame();


    return 0;
}

/*--------------------------------------------------------------------------- */
/* 関数名：                                                                   */
/* 機  能：                                                                   */
/* 戻り値：    ：                                                             */
/* 引  数：    ：                                                             */
/*                                                                            */
/*--------------------------------------------------------------------------- */

void startGame(){

    char janGame[3][20] = { "グー",
                            "パー",
                            "チョキ"
                            };
    int randG; //ランダムでパー、グー、チョキをきめる
    int myG;
    
    srand((unsigned)time(NULL));
    randG = rand() % 3;
    
    scanf("%d", &myG);
    while(myG < 1 || myG > 3){
        printf("もう一度(1~3): ");
        scanf("%d", &myG);
    }

    printf("\nぽん!\n\n");

    printf("あなた：%s\n", janGame[myG-1]);
    printf("相手  ：%s\n", janGame[randG]);

    result(janGame[myG-1], janGame[randG]);
    
}


void result(char *value1, char *value2){

    if(strcmp(value1, value2) == 0){
        printf("\nあいこで・・・\n");
        printf("しょ。。\n");
        startGame();
    }
    else if(strcmp(value1, "グー") == 0){
        if(strcmp(value2, "パー")== 0){
            printf("\nあなたの負けです。。\n");
        }
        else if(strcmp(value2, "チョキ")== 0){
            printf("\nあなたの勝ちです!\n");
        }
    }
    else if(strcmp(value1, "パー") == 0){
        if(strcmp(value2, "グー") == 0){
             printf("\nあなたの勝ちです!\n");
        }
        else if(strcmp(value2, "チョキ") ==0){
            printf("\nあなたの負けです。。\n");
        }
    }
    else if(strcmp(value1, "チョキ") == 0){
        if(strcmp(value2, "グー")){
             printf("\nあなたの負けです。。\n");
        }
        else if(strcmp(value2, "パー")==0){
            printf("\nあなたの勝ちです!\n");
        }
    }
}

/*
じゃんけんをします
スペースキーを押してください

じゃんけん・・・

何を出す？
グー：1
パー：2
チョキ：3

> 1　　　　←キーボード入力値

ぽん！

あなた：グー
相手　：パー

あなたの負けです。。

もう一度しますか？
はい：1
いいえ：0





*/